In [ ]:
# Load the SQL magic extension
%load_ext sql
    
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%config SqlMagic.autopandas = False

In [2]:
%load_ext sql
%sql mysql+pymysql://mfre521d_user:mfre521d_user_pw@127.0.0.1:3306/mfre521d

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
# Database connection parameters
DB_USER = "mfre521d_user"
DB_PASSWORD = "mfre521d_user_pw"
DB_HOST = "localhost"
DB_PORT = "3306"
DB_NAME = "mfre521d"

# Create connection string
connection_string = f"mysql+pymysql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}:{DB_PORT}/{DB_NAME}"

# Connect using SQL magic
%sql {connection_string}

In [4]:
%%sql

SELECT 'Connection successful!' AS status, NOW() AS current_ts;

   mysql+pymysql://mfre521d_user:***@127.0.0.1:3306/mfre521d
 * mysql+pymysql://mfre521d_user:***@localhost:3306/mfre521d
1 rows affected.

[('Connection successful!', datetime.datetime(2026, 1, 12, 23, 12, 3))]

Import CVS Files - 1) Crop Production, and 2) Temperature Anomalies

In [11]:
from pathlib import Path
import pandas as pd

# Locate repo root
# Notebook is in: 521d_assignment/notebooks/
# Repo root is:   521d_assignment/
repo_root = Path.cwd().resolve().parents[0]

print("Repo root:", repo_root)

# Build paths to CSV files
crop_csv = repo_root / "data" / "crop_production_1990_2023.csv"
temp_csv = repo_root / "data" / "temperature_anomalies_1990_2023.csv"

print("Crop CSV exists:", crop_csv.exists())
print("Temp CSV exists:", temp_csv.exists())

Repo root: /Users/claremengebier/Desktop/MFRE/FRE 521D/521d_assignment
Crop CSV exists: True
Temp CSV exists: True

In [15]:
# Read crop production data
crop_df_raw = pd.read_csv(
    crop_csv,
    na_values=["..", "NA", ""],
    encoding="utf-8"
)

print("Crop data shape:", crop_df_raw.shape)
crop_df_raw.head()

Crop data shape: (4187, 12)

,Country,ISO3_Code,Region,Income_Group,Year,Crop,Area_Harvested_Ha,Production_Tonnes,Yield_Kg_Ha,Fertilizer_Use_Kg_Ha,Irrigation_Pct,Notes
0,China,CHN,East Asia,Upper middle income,2001.0,Soybeans,3751494,12036421.75,3208.43,100.9,NaN,NaN
1,Nepal,NPL,South Asia,Low income,1993.0,Maize,2112762,11377270.55,"5385,02","19,14",9.8,NaN
2,South Korea,KOR,East Asia,High income,1995.0,Soybeans,1650777,7474101.16,4527.63,193.84,56.6,NaN
3,United States,USA,North America,High income,2018.0,Wheat,4782989,32397951.41,6773.58,205.12,62.5,NaN
4,Japan,JPN,East Asia,High income,2013.0,Rice,5434696,58322509.35,"10731,51","211,64",61.4,NaN

In [14]:
# Read temperature anomaly data
temp_df_raw = pd.read_csv(
    temp_csv,
    na_values=["NA", ""],
    encoding="utf-8"
)

print("Temperature data shape:", temp_df_raw.shape)
temp_df_raw.head()

Temperature data shape: (1137, 15)

,Country_Name,Year,Annual_Anomaly_C,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,United States of America,1990,0.07,(0.02),NaN,NaN,-0.09,(0.11),0.44,-0.44,0.3,-0.08,(0.03),-0.31,-0.39
1,United States of America,1991,0.2,0.36,0.4,0.6,0.74,0.22,0.34,0.22,0.7,NaN,-0.44,-0.5,-0.22
2,United States of America,1992,0.54,0.46,0.76,0.85,0.68,0.6,0.98,0.52,0.92,0.53,0.01,0.09,0.07
3,United States of America,1993,0.43,0.28,0.22,0.74,0.6,NaN,1.3,0.81,0.35,(0.3),0.04,0.55,-0.13
4,United States of America,1994,0.87,0.75,0.86,0.65,1.14,0.45,1.71,1.27,1.04,0.01,0.62,1.05,0.88